cif/cart/test/resources/mApplyGiftCardToCart.json

{
    "data": {
      "applyGiftCardToCart": {
        "cart": {
          "id": "76f11761-0d10-4dd3-806d-8ce04ffcd653",
          "total_quantity": 1,
          "applied_coupons": [
            {
              "code": "FLAT20",
              "__typename": "AppliedCoupon"
            }
          ],
          "__typename": "Cart",
          "applied_gift_cards": [
            {
              "code": "FLAT20",
              "current_balance": {
                "currency": "EUR",
                "value": 13350,
                "__typename": "Money"
              },
              "__typename": "AppliedGiftCard",
              "applied_balance": {
              "__typename": "Money",
              "currency": "EUR",
              "value": 13350
            }
            }
          ],
          "items": [
            {
              "id": "0",
              "product": {
                "id": null,
                "name": "Bag medium Liu Jo olive yo",
                "sku": "8ace3adf-2373-4b1b-94df-a022f3e9f1fe",
                "url_key": null,
                "url_suffix": null,
                "thumbnail": {
                  "url": "https://s3-eu-west-1.amazonaws.com/commercetools-maximilian/products/079718_1_large.jpg",
                  "__typename": "ProductImage"
                },
                "small_image": {
                  "url": "https://s3-eu-west-1.amazonaws.com/commercetools-maximilian/products/079718_1_large.jpg",
                  "__typename": "ProductImage"
                },
                "stock_status": null,
                "__typename": "SimpleProduct"
              },
              "prices": {
                "price": {
                  "currency": "EUR",
                  "value": 14500,
                  "__typename": "Money"
                },
                "__typename": "CartItemPrices"
              },
              "quantity": 1,
              "__typename": "SimpleCartItem"
            }
          ],
          "shipping_addresses": [
            {
              "selected_shipping_method": {
                "amount": {
                  "currency": "EUR",
                  "value": 10,
                  "__typename": "Money"
                },
                "__typename": "SelectedShippingMethod"
              },
              "street": [
                "Magento Shipping"
              ],
              "__typename": "ShippingCartAddress"
            }
          ],
          "prices": {
            "applied_taxes": [],
            "__typename": "CartPrices",
            "discounts": null,
            "grand_total": {
              "currency": "EUR",
              "value": 13350,
              "__typename": "Money"
            },
            "subtotal_excluding_tax": {
              "currency": "EUR",
              "value": 13350,
              "__typename": "Money"
            }
          },
          "available_payment_methods": [
            {
              "code": "credit_card",
              "title": "Credit Card",
              "__typename": "AvailablePaymentMethod"
            },
            {
              "code": "cash_on_delivery",
              "title": "Cash On Delivery",
              "__typename": "AvailablePaymentMethod"
            },
            {
              "code": "free",
              "title": "Free",
              "__typename": "AvailablePaymentMethod"
            }
          ]
        },
        "__typename": "ApplyGiftCardToCartOutput"
      }
    }
  }